In [2]:
import pandas as pd

In [26]:
data = {'city': ['mumbai', 'gujrat','banglore', 'rajshthan'],
       'temprature': [80,40,10,100],}
df1 = pd.DataFrame(data)

In [37]:
data2 = {'city': ['mumbai', 'gujrat', 'bangla'],
        'humanidity': ['hot', 'warm', 'normal']}
df2 = pd.DataFrame(data2)

In [38]:
df1

        city  temprature
0     mumbai          80
1     gujrat          40
2   banglore          10
3  rajshthan         100

In [39]:
df2

     city humanidity
0  mumbai        hot
1  gujrat       warm
2  bangla     normal

In [40]:
pd.merge(df1, df2, on='city') # by default it having inner join method means ki inner

     city  temprature humanidity
0  mumbai          80        hot
1  gujrat          40       warm

In [41]:
pd.merge(df1, df2 , on = 'city', how = 'outer')

        city  temprature humanidity
0     mumbai        80.0        hot
1     gujrat        40.0       warm
2   banglore        10.0        NaN
3  rajshthan       100.0        NaN
4     bangla         NaN     normal

In [44]:
pd.merge(df1, df2, on = 'city', how ='left')

        city  temprature humanidity
0     mumbai          80        hot
1     gujrat          40       warm
2   banglore          10        NaN
3  rajshthan         100        NaN

In [45]:
pd.merge(df1, df2, on = 'city', how= 'right')

     city  temprature humanidity
0  mumbai        80.0        hot
1  gujrat        40.0       warm
2  bangla         NaN     normal

In [50]:
data = {'city': ['mumbai', 'gujrat','banglore', 'rajshthan'],
       'temprature': [80,40,10,100],
       'humanidity': ['hot', 'warm', 'normal', 'hot']}
df11 = pd.DataFrame(data)

In [52]:
data2 = {'city': ['mumbai', 'gujrat', 'bangla'],
        'humanidity': ['hot', 'warm', 'normal'],
        'temprature': [80,40,10]}
df22 = pd.DataFrame(data2)

In [53]:
df11

        city  temprature humanidity
0     mumbai          80        hot
1     gujrat          40       warm
2   banglore          10     normal
3  rajshthan         100        hot

In [54]:
df22

     city humanidity  temprature
0  mumbai        hot          80
1  gujrat       warm          40
2  bangla     normal          10

In [58]:
pd.merge(df11, df22, on= 'city', how= 'outer', suffixes=('_left', '_right'), indicator = True)

,city,temprature_left,humanidity_left,humanidity_right,temprature_right,_merge
0,mumbai,80.0,hot,hot,80.0,both
1,gujrat,40.0,warm,warm,40.0,both
2,banglore,10.0,normal,NaN,NaN,left_only
3,rajshthan,100.0,hot,NaN,NaN,left_only
4,bangla,NaN,NaN,normal,10.0,right_only